
// quiz 1
// Вопрос: Что выведет typeof null в JavaScript?
// Ответы:
// - "null"
// - "object" ✅
// - "undefined"
// - "number"

// quiz 2
// Вопрос: Что делает метод parseInt()?
// Ответы:
// - Преобразует строку в булево значение
// - Округляет число до целого
// - Преобразует строку в целое число ✅
// - Преобразует число в строку

// quiz 3
// Вопрос: Какой из этих типов данных существует в JavaScript?
// Ответы:
// - float
// - number ✅
// - decimal
// - digit

// quiz 4
// Вопрос: Что вернёт выражение true && false?
// Ответы:
// - true
// - false ✅
// - "false"
// - undefined

// quiz 5
// Вопрос: Как объявить переменную, которую можно переназначить?
// Ответы:
// - const
// - define
// - let ✅
// - fixed

// quiz 6
// Вопрос: Что делает метод alert()?
// Ответы:
// - Выводит сообщение в консоль
// - Создаёт модальное окно с вводом
// - Показывает всплывающее окно с текстом ✅
// - Запускает таймер

// quiz 7
// Вопрос: Что выведется в консоль?
// Ответы:
// - Начал рендеринг UI -> Фоновая задача выполнена! -> Закончил рендеринг UI
// - Начал рендеринг UI -> Закончил рендеринг UI -> Фоновая задача выполнена! ✅
// - Фоновая задача выполнена! -> Начал рендеринг UI -> Закончил рендеринг UI
// - Ошибка

// quiz 8
// Вопрос: Какой порядок вывода будет в консоли?
// Ответы:
// - 1, 2, 3, 4
// - 2, 4, 3, 1 ✅
// - 2, 3, 4, 1
// - 1, 3, 2, 4

// quiz 9
// Вопрос: Что такое синхронный код?
// Ответы:
// - Код, который выполняется строка за строкой, ожидая завершения предыдущей ✅
// - Код, который выполняется одновременно в нескольких потоках
// - Код, который выполняется только после определенного события
// - Код, который использует setTimeout

// quiz 10
// Вопрос: Что такое Promise?
// Ответы:
// - Это функция, которая выполняется немедленно
// - Это объект, представляющий результат асинхронной операции, может быть доступен сейчас или в будущем ✅
// - Это способ писать синхронный код
// - Это переменная, которая всегда хранит строку 'pending'

// quiz 11
// Вопрос: Что выведет код, если Promise выполнится успешно?
// Ответы:
// - Ошибка
// - Ответ сервера: OK ✅
// - Ответ сервера: undefined
// - Ничего не выведется

// quiz 12
// Вопрос: Что делает метод .then() у Promise?
// Ответы:
// - Создаёт новый Promise
// - Отменяет выполнение Promise
// - Обрабатывает ошибку Promise
// - Регистрирует колбэк, который выполнится при успешном завершении Promise ✅

// quiz 13
// Вопрос: Что выведет код, если Promise будет отклонен?
// Ответы:
// - Успех: undefined
// - Ошибка сети: Сервер недоступен ✅
// - Ошибка выполнения кода
// - Ничего не выведется

// quiz 14
// Вопрос: Когда выполнится блок .finally()?
// Ответы:
// - Только если Promise выполнен успешно
// - Только если Promise отклонен
// - Выполнится в любом случае: и при успехе, и при ошибке ✅
// - Никогда не выполнится
