// Что такое Promise?
// Объект, который представляет собой "контейнер" для значения, которое станет известно в будущем (например, результат API-запроса).


// const apiRequest = new Promise((resolve, reject) => {
//   const success = Math.random() > 0.2;
//   if (success) {
//     resolve({ data: 'Пользователь найден' });
//   } else {
//     reject(new Error('404 Not Found'));
//   }
// });

------

// Это объект, представляющий результат асинхронной операции, может быть доступен сейчас или в будущем
